### Загловок

In [3]:
import pandas as pd

In [12]:
a = [1, 2, 3]
b = [2, 4, 6]
idx = ['a', 'b', 'c']

Генерим dataframe из списков

In [14]:
df = pd.DataFrame(list(zip(a, b)), columns =['col1', 'col2'], index=range(0,3))
df

   col1  col2
0     1     2
1     2     4
2     3     6

Получаем столбец

In [45]:
list(df['col1'])

[1, 2, 3]

In [26]:
list(df.iloc[2])

[3, 6]

In [30]:
df2 = df[df['col2'] > 2]
df2

   col1  col2
1     2     4
2     3     6

In [31]:
df['col2'].iloc[2]

6

In [36]:
df3 = pd.read_csv('train.csv', sep="\t", index_col='idx')
df3

          Score                                               Text
idx
0      Positive  В Альфа-Банке работает замечательная девушка -...
1      Negative  Оформляя рассрочку в м. Видео в меге тёплый ст...
2      Positive  Очень порадовала оперативность работы в банке....
3      Negative  Имела неосторожность оформить потреб. кредит в...
4      Negative  Небольшая предыстория: Нашел на сайте MDM банк...
...         ...                                                ...
13994  Positive  О высокой надёжности МКБ, порядочности и добро...
13995  Positive  Обслуживаюсь в офисе на Чернореченской 42а, ка...
13996  Positive  Попала сегодня в очень неприятную ситуацию. Ре...
13997  Positive  Добрый день! Давно являюсь клиентом банка Русс...
13998  Negative  Сначала было все банально. Взял в кредит mp3 п...

[13999 rows x 2 columns]

In [37]:
df4 = pd.read_csv('train2.csv')
df4

       user_id  course_id
0        39972         34
1        56815         51
2        63734         20
3        17896         81
4        36961         64
...        ...        ...
10267    10520         10
10268    62231         40
10269   150361        148
10270     4182          7
10271   166173        145

[10272 rows x 2 columns]

In [40]:
df5 = pd.read_csv('train3.csv', header=None, names=['col1', 'col2'])
df5

         col1  col2
0       39972    34
1       56815    51
2       63734    20
3       17896    81
4       36961    64
...       ...   ...
10267   10520    10
10268   62231    40
10269  150361   148
10270    4182     7
10271  166173   145

[10272 rows x 2 columns]

In [43]:
df2.to_csv('submission.csv', sep="\t", index=False)